app/controllers/orders_controller.rb

 def show
    @order = Order.find(params[:id])
    @items = @order.line_items
    @total = 0
    @items.each do |item|
---
SELECT * FROM "orders" WHERE ("orders"."id" = 5)
SELECT * FROM "line_items" WHERE ("line_items".order_id = 5)

def destroy
      @order = Order.find(params[:id])
    begin
      @order.destroy
---
SELECT * FROM "orders" WHERE ("orders"."id" = 2)
DELETE FROM "orders" WHERE "id" = 2