app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image_url", "updated_at", "title", "description", "created_at") VALUES('/images/kelly_bag.jpg', '2010-04-20 22:12:26', 'Kelly Hermes bag', 'One of the most sought-after purses of recent decades has to be the Hermès Kelly bag, a timeless handbag design, right up there with it’s sister, the Hermès Birkin. The Kelly bag, however, has enjoyed a longer life than its sibling, when it was thrust into the limelight in 1956.

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)
UPDATE "products" SET "updated_at" = '2011-05-31 00:15:12', "title" = 'HEAD Snowboard 157' WHERE "id" = 49

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 45)
DELETE FROM "products" WHERE "id" = 45