app/controllers/store_controller.rb

SELECT * FROM "products" WHERE (title LIKE '%%')
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 2)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-05-30 22:10:26', 45, 1, 17, 27.75, '2011-05-30 22:10:26')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Kamila', '2010-05-10 20:46:50', 'cc', 'Szczesliwa 14', 'kamila@gmaic.co', '2010-05-10 20:46:50')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save