app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('kamelury', '854369200.302308685455955', '2010-05-11 10:57:36', '6d83b0b9228cbf2660eb95a0578b82e54ab1d5b7', '2010-05-11 10:57:36')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 2
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy